Repository: fatimachubb/CHUBBHR
Catalog: CHUBBHR/Resources/Views/Usuarios/Evaluar.*.resx
Languages: es

# ac
source: Action:
es: Acción:

# Acontinuo
source: Continuous learning
es: Aprendizaje Continuo

# adap
source: Adaptability
es: Adaptabilidad

# All
source: All Levels
es: Todos los niveles

# apren
source: Has self-learning and self-motivation to acquire new knowledge and deepen technical experience autonomously and develop their capabilities on their own.
es: Cuenta con autoaprendizaje y automotivación para adquirir nuevos conocimientos y profundizar la experiencia técnica de forma autónoma y desarrollar sus capacidades por su cuenta.

# asum
source: Takes on challenging work assignments that lead to professional growth.
es: Asume asignaciones de trabajo desafiantes que conducen a crecimiento profesional.

# Colabin
source: Individual Contributor
es: Colaborador Individual

# comen
source: Comments / General Observations:
es: Comentarios / Observaciones Generales:

# compa
source: Compatibility
es: Compatibilidad

# d1
source: What happened?
es: ¿Qué sucedió?

# d2
source: What made you do it that way?
es: ¿Qué te llevó a hacerlo de esa manera?

# d3
source: You learned?
es: ¿Qué aprendiste?

# dem
source: Demonstrates the interest and ability to expand their professional experience and develop new skills.
es: Demuestra el interés y capacidad de ampliar su experiencia profesional y desarrollar nuevas habilidades.

# des
source: Describe to me the biggest problem you have experienced in your current role.
es: Descríbeme el mayor problema que hayas experimentado en tu rol actual.

# descom
source: Deploy competencies
es: Desplegar competencias

# ees
source: Strategic approach
es: Enfoque Estratégico

# ejec
source: Execution
es: Ejecución

# Eval
source: Evaluate
es: Evaluar

# evaluate
source: Evaluate the candidate's response according to the rating scale:
es: Evalúa la respuesta del candidato de acuerdo con la escala de calificación:

source: Evaluation of competencies
es: Evaluación de competencias

# exportpdf
source: Export to Excel or import PDF
es: Exportar a Excel o importar PDF

# icor
source: Integrity and Courage
es: Integridad y Coraje

# influ
source: Influence
es: Influencia

# ini
source: Initiative
es: Iniciativa

# ini1
source: Is willing to do more than is required or expected.
es: Está dispuesto a hacer más de lo que se requiere o se espera.

# ini2
source: Proposes and takes actions in order to achieve an objective that contributes to the team's vision, without being asked.
es: Propone y toma acciones con el fin de lograr un objetivo que contribuya a la visión del equipo, sin que se le haya solicitado.

# ini3
source: Shows drive and willingness to go the extra mile, in terms of agility and energy.
es: Muestra empuje y disposición de hacer un esfuerzo adicional, en términos de agilidad y energía.

# ini4
source: Is self-motivated and takes advantage of opportunities to make a difference and generate value for his or her area and for others.
es: Es auto motivado y aprovecha oportunidades para hacer la diferencia y generar valor para su área y para los demás.

source: Leaders
es: Líderes

# lide
source: Inclusive Team Leadership
es: Liderazgo Equipo Inclusivo

# oc
source: Tell me about a time when you had to change your strategy to solve a problem.
es: Háblame de alguna ocasión en la que hayas tenido que cambiar tu estrategia para lograr solucionar un problema.

# oc1
source: What did you do?
es: ¿Qué hiciste?

# ocli
source: Customer orientation
es: Orientación al Cliente

# ores
source: Orientation to results
es: Orientación a Resultados

# oval
source: Values Orientation
es: Orientación a Valores

# re
source: Results:
es: Resultado:

# Rproblemas
source: Problem resolution
es: Resolución de Problemas

# Rproblemas1
source: Has an organized and logical approach to reflecting on complex problems and issues.
es: Tiene un enfoque organizado y lógico para reflexionar sobre los problemas y asuntos complejos.

# Rproblemas2
source: Simplifies complexity by breaking down problems into manageable parts.
es: Simplifica la complejidad desglosando los problemas en partes manejables.

# Rproblemas3
source: Looks beyond the obvious to achieve results.
es: Busca más allá de lo obvio para lograr resultados.

# Rproblemas4
source: Develops introspection of problems, issues and situations in an effective and agile way.
es: Desarrolla introspección de los problemas, asuntos y situaciones de forma efectiva y ágil.

# see
source: See all competitions
es: Ver todas las competencias

# select
source: Select 1 or 2 suggested questions to evaluate this competency
es: Selecciona 1 o 2 preguntas sugeridas para evaluar esta competencia

# sit
source: Tell me about a situation in which you had to address a problem and did not have all the necessary information.
es: Cuéntame de alguna situación en la que tuviste que abordar un problema y no contabas con toda la información necesaria.

# sit1
source: What was expected of you?
es: ¿Qué se esperaba de ti?

# sit2
source: What actions did you take?
es: ¿Qué acciones llevaste a cabo?

# sit3
source: What was the result according to your actions?
es: ¿Cuál fue el resultado de acuerdo con tus acciones?

# st
source: Situation:
es: Situacion:

# STAR
source: Briefly document the candidate's responses, according to the STAR MODEL
es: Documenta brevemente las respuestas del candidato, de acuerdo con el MODELO STAR

source: Submit
es: Enviar

# t1
source: What happened?
es: ¿Qué pasó?

# t2
source: What obstacles did you face?
es: ¿Con qué obstáculos te enfrentaste?

# t3
source: How did you solve it?
es: ¿Cómo lo resolviste?

# t4
source: Which it was the result?
es: ¿Cuál fue el resultado?

# ta
source: Task:
es: Tarea:

# TCandidate
source: The candidate:
es: El candidato:

# tell
source: Tell me about a situation in which you could not meet the established delivery time.
es: Cuéntame de alguna situación en la que no pudiste cumplir con el tiempo establecido de entrega.

# tp
source: Work under pressure
es: Trabajo bajo presión

# visne
source: Business vision
es: Visión de Negocio
